import { FETCH_GOALS, UPDATE_GOAL} from './goalsActionTypes'


const getSessionGoals = () => {
    const sessionGoals = [ 
        { id: 1,
          serialNum: 1,
          title:  "1.תני לי x",
          description: "במהלך משחק משותף בחפצים או בפעילות אכילה \ הלבשה, כשירדן תקבל הוראה מילולית של 'תני לי X' עבור 8-10 אובייקטים ספציפיים, ירדן תיתן את האובייקט בליווי מבט. ירדן תיתן את האובייקטים בפעילויות עם שני מבוגרים שונים, לאורך 3 ימים עוקבים",
          skillType: "שפה רצפטיבית",
          subgoals: [
            {   id: 1.1,
                serialNum: 1.1,
                title: "1.1",
                description: "ירדן נותנת 3-4 אובייקטים ללא מבט, עם סיוע של הושטת יד",
                doneAt: "",
              },
            {   id: 1.2,
                serialNum: 1.2,
                title: "1.2",
                description: "ירדן נותנת 3-4 אובייקטים בליווי מבט, עם סיוע של הושטת יד + כניסה לטווח הראייה של המטפל",
                doneAt: "",
              }
          ],
          activities: [
            {   id: 1,
                title: "בועות סבון",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c1,
            },
            {   id: 2,
                title: "צעצוע ישן",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c7,
            },
            { id: 9,
              title: "בנייה בקוביות",
              description: " חומה ומגדל חומה ומגדל חומה ומגדל לה. מריה מגדלנה יור דה קריצ'ר אוף דה נייט",
              color: colors.c5,
            },
          ]
        },
        { id: 2,
          serialNum: 2,
          title:  "2. חפשי ותני לי את X",
          description: "במהלך משחק משותף בחפצים או בפעילות אכילה \ הלבשה, כשירדן תקבל הוראה מילולית של 'תני לי X' עבור 8-10 אובייקטים ספציפיים, ירדן תיתן את האובייקט בליווי מבט. ירדן תיתן את האובייקטים בפעילויות עם שני מבוגרים שונים, לאורך 3 ימים עוקבים",
          skillType: "שפה רצפטיבית",
          subgoals: [
              {   id: 2.1,
                  serialNum: 2.1,
                  title: "2.1",
                  description: "ירדן נותנת 3-4 אובייקטים ללא מבט, עם סיוע של הושטת יד",
                  doneAt: "",
              },
          ],
          activities: [
            {   id: 1,
                title: "בועות סבון",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c1,
            },
            {   id: 4,
                title: "צעצוע חדש",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c3,
            },
            { id: 6,
              title: "ציור",
              description: "  כנסי כבר לבאטמוביל וניסע...קורונה ג'ננה שלום שלום ",
              color: colors.c6,
            },
            {   id: 8,
                title: "השחלת חרוזים",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c8,
            },
            {   id: 12,
                title: "הכנת עוגיות",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c9,
            },
            { id: 10,
              title: "ריקוד",
              description: "  כנסי כבר לבאטמוביל וניסע...קורונה ג'ננה שלום שלום ",
              color: colors.c10,
            },
            {   id: 13,
                title: "קריאת סיפור",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c11,
            },
          ]
        },
        { id: 3,
          serialNum: 3,
          title:  "3. שיתוף בפעילות",
          description: "במהלך משחק משותף בחפצים או בפעילות אכילה \ הלבשה, כשירדן תקבל הוראה מילולית של 'תני לי X' עבור 8-10 אובייקטים ספציפיים, ירדן תיתן את האובייקט בליווי מבט. ירדן תיתן את האובייקטים בפעילויות עם שני מבוגרים שונים, לאורך 3 ימים עוקבים",
          skillType: "שפה רצפטיבית",
          subgoals: [
              {   id: 3.1,
                  serialNum: 3.1,
                  title: "2.1",
                  description: "ירדן נותנת 3-4 אובייקטים ללא מבט, עם סיוע של הושטת יד",
                  doneAt: "",
              },
            //   {   id: 3.2,
            //       serialNum: 3.2,
            //       title: "2.2",
            //       description: "ירדן נותנת 3-4 אובייקטים בליווי מבט, עם סיוע של הושטת יד + כניסה לטווח הראייה של המטפל",
            //       doneAt: "",
            //   }
          ],
          activities: [
            {   id: 1,
                title: "בועות סבון",
                // title: "אמא",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c1,
            },
            { id: 3,
              title: "הרכבת פאזל",
              // title: "אמא",
              description: "מציאת החלק המתאים של פאזל מגנטי",
              color: colors.c2,
            },
            {   id: 5,
                title: "משחק בבובות",
                description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
                color: colors.c4,
            },
            {   id: 4,
              title: "צעצוע חדש",
              description: "1. ללכוד בועה בודדת ולמקמה בין הפנים שלך לשל ירדן 2.'פוף', ירדן תפוצץ את הבועה עם  האצבע- קשר עין וצחוק משותף 3. לעצור מדי פעם ולהמתין ליוזמה של ירדן",
              color: colors.c3,
            },
            { id: 9,
              title: "בנייה בקוביות",
              description: " חומה ומגדל חומה ומגדל חומה ומגדל לה. מריה מגדלנה יור דה קריצ'ר אוף דה נייט",
              color: colors.c5,
            },
          ],
        },
    ];
    return (sessionGoals);
};

export const updateGoal = (goal) => {
    return {
        type: UPDATE_GOAL,
        payload: goal
    }
};

export const fetchGoals = () => {
    // return (dispatch) => {
    //     fetch('${URL}/goals')
    //         .then(response => response.json())
    //         .then(data => {
    //             dispatch({
    //                 type: FETCH_GOALS,
    //                 payload: data
    //             })
    //         }).catch(function(err) {
    //             console.log( err);
    //         })
    // }

    const goals = getSessionGoals();
    return (dispatch) => {
        dispatch({
            type: FETCH_GOALS,
            payload: goals
        })
    }
};